Autodesk.Revit.DB.IFCVersion
An enumerated type listing available IFC file versions into which a file may be exported.

Autodesk.Revit.DB.IFCVersion.IFC2x3BFM
IFC2x3 Basic FM Handover View

Autodesk.Revit.DB.IFCVersion.IFC4DTV
IFC4 Design Transfer View

Autodesk.Revit.DB.IFCVersion.IFC4RV
IFC4 Reference View

Autodesk.Revit.DB.IFCVersion.IFC2x3FM
IFC2x3 Extended FM Handover View

Autodesk.Revit.DB.IFCVersion.IFC4
IFC 4 file format.

Autodesk.Revit.DB.IFCVersion.IFCCOBIE
IFC GSA COBIE 2010 file format.  This is a variant of IFC 2x3 used for
submitting files that are COBIE 2010-complaint.

Autodesk.Revit.DB.IFCVersion.IFC2x3CV2
IFC 2x3 Coordination View 2.0 file format.  This is a variant of IFC 2x3 used for
exporting files using the Coordination View 2.0 model view.

Autodesk.Revit.DB.IFCVersion.IFCBCA
IFC BCA file format. This is a certified variant of IFC 2x2 used for
submitting files to the Singapore BCA ePlan Check Server.

Autodesk.Revit.DB.IFCVersion.IFC2x3
IFC 2x3 file format.

Autodesk.Revit.DB.IFCVersion.IFC2x2
IFC 2x2 file format.

Autodesk.Revit.DB.IFCVersion.Default
The Autodesk Revit application's default export format.  Note that this may change
as the defaults change in the Revit user interface.